/*
 * File      : zscl1_process.c
 *
 * Change Logs:
 *---------------------------------------------------------------------------------------
 * Date         |  Author    |   Notes
 *---------------------------------------------------------------------------------------
 * 2023-11-25   |  陈雄伟	   |   the first version
 *---------------------------------------------------------------------------------------
 */

#include "zscl1_process.h"

// ****************************************************************************************
// 功能：通信成功率统计
// 入参：TxFinishCnt:发送成功次数
//			 RxFinishCnt:正确接收次数
//			 OkFlag:通信状态信息
//			 ErrorCount:错误状态信息
//			 mRateNow:通信成功率现在值
//			 mRateEvil:通信成功率最恶值
//			 mRateBest:通信成功率最良值
//			 mRateAverage:通信成功率平均值
//			 cycle:统计周期（次数）
//       detectecnt:平均值计算计数
//       TxFinishCntx:上周期发送成功次数
//       RxFinishCntx:上周期正确接收次数
// 返回：无
// ****************************************************************************************
void Communication_detecte(
	                          uint64_t * TxFinishCnt,
														uint64_t * RxFinishCnt,
														uint8_t  * OkFlag,
														uint8_t  * ErrorCount,
														uint16_t * mRateNow,
														uint16_t * mRateEvil,
														uint16_t * mRateBest,
														uint16_t * mRateAverage,
														uint16_t * cycle,
														uint16_t * detectecnt,
														uint64_t * TxFinishCntx,
														uint64_t * RxFinishCntx,
														uint8_t type
                          )
{
	
}

//****************************************************************************************
//功能：和校验计算
//入参：verify_data		校验数据存储起始地址
//			verify_cnt		校验数据长度
//返回：verify_sum		校验结果
//****************************************************************************************
uint8_t sum_chk(uint8_t *verify_data, uint16_t verify_cnt)
{
	uint8_t  verify_sum;
	
	return verify_sum; 
}

//****************************************************************************************
//功能：异或校验计算
//入参：verify_data		校验数据存储起始地址
//			verify_cnt		校验数据长度
//返回：verify_xor		校验结果
//****************************************************************************************
uint8_t xor_chk(uint8_t *verify_data, uint16_t verify_cnt)
{
	uint8_t  verify_xor;

	return verify_xor;
}

//****************************************************************************************
//功能：SCL1发送处理
//入参：无
//返回：无
//****************************************************************************************
void Scl1_Data_Pack(void)
{

}

//****************************************************************************************
//功能：Scl1接收处理
//入参：无
//返回：无
//****************************************************************************************
void Scl1_Rx_Verify(void)
{

}